## 파이썬 프로그램 만들기
# 프로그램을 만들려면 가장 먼저 '입력'과 '출력을 생각하라.

# 구구단 프로그램(함수) 만들기
# n단 입력하면 n단 출력하기

# 입력과 출력의 관점
# 1. 함수 이름은? GuGu
# 2. 입력 받는 값은? 2
# 3. 출력하는 값은? 2,4,6,8,..,18
# 4. 결과는 어떤 형태로? 리스트

def GuGu(n):
    result = []
    i = 1
    while i < 10:
        result.append(n*i)
        i = i + 1 
    return result

print(GuGu(2))      ## Result : [2, 4, 6, 8, 10, 12, 14, 16, 18]

# 3과 5의 배수 합하기
# 10미만의 자연수에서 3과 5의 배수를 구하면 3,5,6,9이다.
# 이들의 총합은 23이다. 1000미만의 자연수에서 3의배수와 5의 배수의 총합을 구하라.

# 입력과 출력 관점
# 1. 입력 받는 값은? 1~999(1000미만의 자연수)
# 2. 출력하는 값은? 3의 배수와 5의 배수의 총합
# 3. 생각해 볼것은? 3의 배수와 5의 배수는 어떻게 찾지? 겹칠 때는 어떻게 하지?

result = 0

for n in range(1,1000):
    if n % 3 == 0 or n % 5 == 0:
     # 3,5로 나눈 나머지가 0이면 3,5의 배수 이다.
        result += n

print(result)       ## Result : 233168

# 게시판 페이징 하기
# 게시물의 총 건수와 한 페이지에 보여줄 게시물 수를 입력으로 주었을 때 총 페이지수를 출력하는 프로그램

# 입력과 출력 관점
# 1. 함수의 이름은? GetTotalPage
# 2. 입력받는 값은? 게시물의 총 건수(m), 한 페이지에 보여 줄 게시물 수 (n)
# 3. 출력하는 값은? 총 페이지 수

def GetTotalPage(m,n):
    if m % n == 0:
        return m // n
    else:
        return m // n + 1

print(GetTotalPage(5,10))       ## Result : 1
print(GetTotalPage(15,10))      ## Result : 2
print(GetTotalPage(25,10))      ## Result : 3
print(GetTotalPage(30,10))      ## Result : 3

# 간단한 메모장 만들기
# 원하는 메모를 파일에 저장하고 추가 및 조회가 가능한 간단한 메모장을 만들어 보자.

# 입력과 출력 관점
# 1. 필요한 기능은? 메모 추가하기,조회하기
# 2. 입력 받는 값은? 메모 내용, 프로그램 실행 옵션
# 3. 출력하는 값은? memo.txt
