## 파이썬 프로그램 만들기
# 프로그램을 만들려면 가장 먼저 '입력'과 '출력을 생각하라.

# 구구단 프로그램(함수) 만들기
# n단 입력하면 n단 출력하기

# 입력과 출력의 관점
# 1. 함수 이름은? GuGu
# 2. 입력 받는 값은? 2
# 3. 출력하는 값은? 2,4,6,8,..,18
# 4. 결과는 어떤 형태로? 리스트

def GuGu(n):
    result = []
    i = 1
    while i < 10:
        result.append(n*i)
        i = i + 1 
    return result

print(GuGu(2))

# 3과 5의 배수 합하기
# 10미만의 자연수에서 3과 5의 배수를 구하면 3,5,6,9이다.
# 이들의 총합은 23이다. 1000미만의 자연수에서 3의배수와 5의 배수의 총합을 구하라.

# 입력과 출력 관점
# 1. 입력 받는 값은? 1~999(1000미만의 자연수)
# 2. 출력하는 값은? 3의 배수와 5의 배수의 총합
# 3. 생각해 볼것은? 3의 배수와 5의 배수는 어떻게 찾지? 겹칠 때는 어떻게 하지?

result = 0

for n in range(1,1000):
    if n % 3 == 0 or n % 5 == 0:
     # 3,5로 나눈 나머지가 0이면 3,5의 배수 이다.
        result += n
print(result)



