# 백준 10171번 아래 예제와 같이 고양이를 출력하시오.

# \    /\
# )  ( ')
# (  /  )
#  \(__)|

print('''\\    /\\''')
print(''' )  ( ')''')
print('''(  /  )''')
print(''' \\(__)|''')

# \를 출력할 때는 \를 두번 입력 해야한다.

# 백준 10172번 아래 예제와 같이 개를 출력하시오.

# |\_/|
# |q p|   /}
# ( 0 )"""\
# |"^"`    |
# ||_/=\\__|

print('''|\\_/|''')
print('''|q p|   /}''')
print('''( 0 )"""\\''')
print('''|"^"`    |''')
print('''||_/=\\\\__|''')

# 백준 1000번 두 정수 A와 B를 입력받은 다음, A+B를 출력하는 프로그램을 작성하시오.
# 첫째 줄에 A와 B가 주어진다. (0 < A, B < 10)
# 첫째 줄에 A+B를 출력한다.

a, b = input().split()
a = int(a)
b = int(b)
print(a+b)

# 백준 1001번 두 정수 A와 B를 입력받은 다음, A-B를 출력하는 프로그램을 작성하시오.
# 첫째 줄에 A와 B가 주어진다. (0 < A, B < 10)
# 첫째 줄에 A-B를 출력한다.

a, b = input().split()
a = int(a)
b = int(b)
print(a-b)

# 백준 10998번 두 정수 A와 B를 입력받은 다음, A×B를 출력하는 프로그램을 작성하시오.
# 첫째 줄에 A와 B가 주어진다. (0 < A, B < 10)
# 첫째 줄에 A×B를 출력한다.

a, b = input().split()
a = int(a)
b = int(b)
print(a*b)

# 백준 1008번 두 정수 A와 B를 입력받은 다음, A/B를 출력하는 프로그램을 작성하시오.
# 첫째 줄에 A와 B가 주어진다. (0 < A, B < 10)
# 첫째 줄에 A/B를 출력한다. 실제 정답과 출력값의 절대오차 또는 상대오차가 10**-9 이하이면 정답이다.

a, b = input().split()
a = int(a)
b = int(b)
print(a/b)

# 백준 10869번 두 자연수 A와 B가 주어진다. 이때, A+B, A-B, A*B, A/B(몫), A%B(나머지)를 출력하는 프로그램을 작성하시오.
# 두 자연수 A와 B가 주어진다. (1 ≤ A, B ≤ 10,000)
# 첫째 줄에 A+B, 둘째 줄에 A-B, 셋째 줄에 A*B, 넷째 줄에 A/B, 다섯째 줄에 A%B를 출력한다.

a, b = input().split()
a = int(a)
b = int(b)
print(a+b)
print(a-b)
print(a*b)
print(a//b)
print(a%b)